Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/A03A.tmx
Source language: en_us
Languages: zh_cn

source: Pirates attempt hijack of another US ship off Somalia coast
zh_cn: 索马里海盗企图劫持另一艘美国货船

source: Pirates fired rocket-propelled grenades and automatic weapons at an American ship carrying humanitarian aid off the coast of Somalia in the fifth attack on a commercial vessel since the US Navy's rescue of a captured freighter captain.
zh_cn: 海盗在索马里外海用火箭弹和自动武器向一艘满载人道主义救援物资的美国货船发动攻击。这是自美国海军成功救出被俘货船船长以来，海盗第五次袭击商船。

source: The MV Liberty Sun was today heading to Kenya with a US Navy escort after the pirates' unsuccessful attempt to seize the cargo vessel and its 20-strong American crew, none of whom were reported injured.
zh_cn: 海盗劫持货船及其二十名的美国船员的企图未得逞，据报道没有人员伤亡。今天，自由太阳号商船在美国海军的护卫下正驶往肯尼亚。

source: "We are under attack by pirates, we are being hit by rockets. Also bullets," one crewman, 26-year-old Thomas Urbik, wrote in an email to his mother. "We are barricaded in the engine room and so far no one is hurt.
zh_cn: “我们受到海盗的攻击，我们正受到火箭还有子弹的打击。”一位船员，２６岁的托马斯·优毕克在给母亲的电子邮件中写道，“我们被困在机舱，目前没有人员受伤。

source: [A] rocket penetrated the bulkhead but the hole is small.
zh_cn: 一枚火箭击穿舱壁，不过，洞口很小。

source: Small fire, too, but put out."
zh_cn: 起了小火，很快就熄灭了。”

source: The ship, which suffered some damage in the incident yesterday, "conducted evasive manoeuvres" to ward off the pirates before the destroyer USS Bainbridge arrived in response to an emergency call, a US Navy spokesman said.
zh_cn: 一位美国海军发言人说，在昨天的事件中受到损伤的这艘船，在美国海军驱逐舰班布里奇号收到紧急呼叫前来接应之前，“采取了回避行动”。

source: The pirate vessel fled before the Navy ship arrived.
zh_cn: 海盗船在军舰到达之前就逃之夭夭了。

source: The Bainbridge is the ship from which US Navy snipers killed three pirates who were holding Richard Phillips, the captain of the freighter Maersk Alabama, on board a drifting lifeboat.
zh_cn: 美国海军狙击手就是在班布里奇号上击毙三名海盗的。当时海盗劫持了阿拉巴马马士基货船船长理查德·菲利普斯登上一艘漂浮在海面救生艇。

source: A fourth pirate was captured in the operation on Sunday.
zh_cn: 在星期天的行动中，第四名海盗被捕。

source: Phillips had been held for five days after exchanging himself to safeguard his crew.
zh_cn: 此前，菲利普斯船长为保护船员而交出自己作为人质，被海盗拘禁了五天。

source: Phillips, who is now due to return to America, was on board the Bainbridge when it arrived to help the Liberty Sun.
zh_cn: 当班布里奇号前往救援自由太阳号时，菲利普斯船长正在舰上，现在即将返回美国。

source: While President Barack Obama has vowed to end the pirates' almost unchallenged ability to capture ships at will in the busy waters of the Gulf of Aden, their vessels have seized four ships and about 60 hostages in the region since Phillips was rescued.
zh_cn: 尽管奥巴马总统曾经发誓要摧毁海盗在繁忙的亚丁湾海域随意捕获船只的几乎无人挑战的能力，海盗船在菲利普斯船长获救以来，已经在该地区扣押了四艘货船和六十名人质。

source: During a rare night-time attack, pirates seized a Greek-managed cargo ship, MV Irene EM, before dawn yesterday.
zh_cn: 昨天黎明前，海盗发起少有的夜袭，捕获了一艘希腊货船， Irene EM号。

source: Soon afterwards they boarded a Lebanese-owned cargo ship, MV Sea Horse.
zh_cn: 之后不久，他们又登上黎巴嫩的海马号商船。

source: Over the preceding two days, pirates had taken over two Egyptian fishing trawlers.
zh_cn: 在过去两天时间内，海盗已经控制了两艘埃及拖网渔船。

source: "Our latest hijackings are meant to show that no one can deter us from protecting our waters from the enemy because we believe in dying for our land," one pirate, Omar Dahir Idle, told the AP news agency from the Somali coastal town of Harardhere.
zh_cn: “我们最近的劫持行动是要表明没有人能够阻止我们抵制敌人保卫自己的海域，因为我们坚信为保卫自己的领域而死值得。”海盗奥马尔·达希尔·艾迪尔在索马里海岸城市哈拉尔代雷对美联社新闻社说。

source: The Liberty Sun, which set off from Houston, had already delivered thousands of tonnes of food aid to a port in Sudan and was en route to deliver more aid to Mombasa.
zh_cn: 自由太阳号从休斯顿起程，已经在苏丹的一个港口卸下了数千吨援助食品，在途中要为蒙马萨送去更多的援助物资。

source: After a relative lull during rough sea conditions at the start of the year, since the end of February pirates off Somalia have attacked at least 78 ships and currently hold 16 vessels, with more than 300 hostages.
zh_cn: 在海面风大浪急期间，年初的海况相对平静。自二月底以来，索马里外海海盗已经至少袭击了７８艘船只，现在还控制着１６艘船只以及３００多名人质。

source: Crews are usually freed after a ransom is paid.
zh_cn: 通常在获得赎金后，海盗才释放船员。

source: While navy boats from a number of countries are patrolling the area, there are too many merchant vessels around the Gulf of Aden for them to be an effective deterrent.
zh_cn: 尽管来自许多国家的军舰正在这片海域巡逻，亚丁湾周围有太多的商船对他们来说仍然具有极强的诱惑力。

source: The Gulf, which links the Suez Canal and the Red Sea to the Indian Ocean, is the shortest route from Asia to Europe and is one of the world's busiest shipping lanes.
zh_cn: 亚丁湾连接苏伊士运河、红海至印度洋，是由亚洲至欧洲的最短的航线，也是世界最繁忙的海洋航路。
